## Import Pandas

In [1]:
import  pandas as pd
import numpy as np
pd.__version__

'2.2.3'

In [2]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [3]:
df = pd.DataFrame({
    "name":["He","she"],
    "age":[21,20]
})
df

  name  age
0   He   21
1  she   20

## Writing the data into files

In [4]:
df.to_csv('data.csv',index=False)

In [5]:
df.to_excel('new.xlsx',sheet_name = 'weather_data')

## Reading the data(csv)

In [6]:
df=pd.read_csv('data.csv')
df

  name  age
0   He   21
1  she   20

## Exploring data

In [7]:
df.head(3)

  name  age
0   He   21
1  she   20

In [8]:
df.tail()

  name  age
0   He   21
1  she   20

In [9]:
df.shape

(2, 2)

In [10]:
df[2:5]

Empty DataFrame
Columns: [name, age]
Index: []

In [11]:
df.columns

Index(['name', 'age'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [13]:
df.dtypes

name    object
age      int64
dtype: object

## Missing values

In [15]:
df.isnull()

    name    age
0  False  False
1  False  False

In [17]:
df = pd.DataFrame({
    "name":["he","she","it"],
    "age":[20,21,None]
})
df

  name   age
0   he  20.0
1  she  21.0
2   it   NaN

In [18]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [19]:
df[df.isnull().any(axis=1)]

  name  age
2   it  NaN

In [20]:
df['age'] = df['age'].fillna(df['age'].mean())

In [21]:
df

  name   age
0   he  20.0
1  she  21.0
2   it  20.5

In [22]:
df_clean = df.dropna()

In [23]:
df_clean

  name   age
0   he  20.0
1  she  21.0
2   it  20.5

## Duplicates

In [24]:
df = pd.DataFrame({
    "name":["he","she","it"],
    "age":[20,21,20]
})
df

  name  age
0   he   20
1  she   21
2   it   20

In [25]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

In [ ]:
df